wrong_str = '  Ваш ответ не распознан. \
Пожалуйста, отвечайте согласно указаниям'
stop_str = 'Отправьте любой символ, чтобы перейти в \
главное меню. Если хотите закончить выполнение программы, \
введите "завершить", "закончить" или "end". '
end_str = "  Если вы захотите прервать тест, отправьте цифру 0."
instructions = [
    'Прочитайте вопрос и выберите верный, по-вашему мнению, ответ.\
    Используйте для ответа цифру 1 или 2.'+end_str,
    'Прочитайте утверждение и напишите "да" или "нет" в зависимости\
    от того, согласны вы с ним или нет.'+end_str
]
introvert = '  Вы интроверт. Вы обращены внутрь себя и сосредоточены на\
 собственных переживаниях; малоконтактны, молчаливы, не любите заводить\
 новые знакомства, рисковать. Ваш внутренний мир превалирует над\
 заинтересованностью окружающей реальностью и другими людьми.'
ambivert = '  Вы амбиверт. В вас сочетаются качества интроверта и экстраверта.\
 Иногда вам хочется побыть в одиночестве, поразмышлять.\
 При других обстоятельствах вы стремитесь к общению, самовыражению.\
 Амбиверты - наиболее устойчивые и стабильные личности, которым удаётся\
 избегать крайностей в поведении.'
extrovert = '  Вы экстраверт. Ваши интересы направляны во внешний мир и к\
 другим людям больше, чем к себе. Экстраверты – люди коммуникативные,\
 оптимистичные, зависимые от общения. Они любят быть в центре внимания,\
 легко заводят знакомства. Экстраверты открыты и могут быть импульсивны.'
character_definition = f'  Известный психологический тест для определения\
 типа личности, созданный швейцарским психиатром Карлом Юнгом.\nКлассификация\
 Юнга разделяет всех людей на интровертов, экстравертов и амбивертов.\nТест\
 включает 20 вопросов, его прохождение займёт несколько минут.'
anxiety_definition = f'  Шкала уровня тревожности Д. Тейлор (Taylor Manifest\
 Anxiety Scale, TMAS). Метод, разработанный в середине прошлого века,\
 определяет тревожность как черту личности. Он с высокой точностью выявляет\
 склонность взрослых и подростков проявлять тревогу.\nТест включает 60\
 вопросов и займёт примерно 20 минут.'
lier = f'  Кажется, в ваших ответах не хватает искренности. Вероятно, вы\
 отвечали недостаточно честно, и мы не можем достоверно оценить ваш\
 результат.\nСоветуем вам перевести дух, вернуться в\
 главное меню и пройти тест заново.'
anxiety_level_5 = f'  Очень высокий уровень тревоги. Возможны психические\
 нарушения. Субъект чувствует угрозу и беспокойство даже в тех жизненных\
 ситуациях, которые к этому не располагают. Он очень критичен к себе. Есть\
 трудности в учебе, работе, общении с людьми, агрессия по отношению к ним.\
 Физическое проявление выражается повышенной потливостью, метеоризмом,\
 слабостью, учащенными дыханием и сердцебиением, покраснениями кожи.\n  Если\
 вы честно отвечали на вопросы, возможно, вам необходима помощь специалиста.'
anxiety_level_4 = f'  Высокий уровень тревожности. Личности этой группы\
 обладают высокой эмоциональностью, низкой самооценкой. Они восприимчивы к\
 критике, боятся высказывать своё мнение и выражать чувства. Такие люди хуже\
 работают в стрессовых ситуациях. Они испытывают необходимость в признании.\
 Могут наблюдаться физические проявления тревожности.\n  Необходимо научиться\
 справляться с напряженными ситуациями и сохранять самообладание для\
 предотвращения развития психосоматических заболеваний.'
anxiety_level_3 = f'  Средний (с тенденцией к высокому) показатель\
 тревожности. Такие люди характеризуются спокойным эмоциональным состоянием,\
 общительностью, умеренной самооценкой. Они достаточно октрыты Но они так же\
 могут испытывать беспричинное беспокойство, когда для этого нет видимых\
 причин.'
anxiety_level_2 = '  Средний (с тенденцией к низкой) показатель тревожности.\
 Такой индивидуум имеет своё мнение, умеет его высказывать и отстаивать. У\
 него достаточно высокая самооценка и независимость взглядов. Спокойно\
 относится к критике. Имеется склонность к лени. Испытывает переживания в тех\
 случаях, когда для этого действительно есть повод.'
anxiety_level_1 = '  Низкая степень тревожности. Такие люди крайне спокойны и\
 независимы, уверены в себе. Они могут показаться бесчувственными, ленивыми и\
 безответственными, однако это не всегда так. В момент возникновения\
 потенциально опасной ситуации они так же способны испытывать страх и\
 напряжение.'

